#### [`repos-partners`] Terraform Plan 📖`failure`



<details><summary>Show Plan</summary>

```tf
github_repository.cdktn-provider-mongodbatlas-go_repo_162BEA2A: Preparing import... [id=cdktn-provider-mongodbatlas-go]
github_repository.cdktn-provider-mongodbatlas_repo_310DCFD4: Preparing import... [id=cdktn-provider-mongodbatlas]
data.github_team.cdktn-team-cdk-terrain: Reading...
github_repository.cdktn-provider-mongodbatlas-go_repo_162BEA2A: Refreshing state... [id=cdktn-provider-mongodbatlas-go]
github_repository.cdktn-provider-mongodbatlas_repo_310DCFD4: Refreshing state... [id=cdktn-provider-mongodbatlas]
data.github_team.cdktn-team-cdk-terrain: Read complete after 2s [id=15746607]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # github_actions_secret.cdktn-provider-grafana_repo_secret-alert-prs-slack-webhook-url_2D7856CE will be created
  + resource "github_actions_secret" "cdktn-provider-grafana_repo_secret-alert-prs-slack-webhook-url_2D7856CE" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-grafana"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-grafana_repo_secret-gh-app-id-alias-PROJEN_APP_ID_56804B3D will be created
  + resource "github_actions_secret" "cdktn-provider-grafana_repo_secret-gh-app-id-alias-PROJEN_APP_ID_56804B3D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-grafana"
      + secret_name     = "PROJEN_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-grafana_repo_secret-gh-app-id_4ACD85C8 will be created
  + resource "github_actions_secret" "cdktn-provider-grafana_repo_secret-gh-app-id_4ACD85C8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-grafana"
      + secret_name     = "GH_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-grafana_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_F12D1A11 will be created
  + resource "github_actions_secret" "cdktn-provider-grafana_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_F12D1A11" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-grafana"
      + secret_name     = "PROJEN_APP_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-grafana_repo_secret-gh-app-private-key_DE11F974 will be created
  + resource "github_actions_secret" "cdktn-provider-grafana_repo_secret-gh-app-private-key_DE11F974" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-grafana"
      + secret_name     = "GH_APP_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-grafana_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_1E366F90 will be created
  + resource "github_actions_secret" "cdktn-provider-grafana_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_1E366F90" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-grafana"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-grafana_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_CEB6BF85 will be created
  + resource "github_actions_secret" "cdktn-provider-grafana_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_CEB6BF85" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-grafana"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-grafana_repo_secret-gh-token_BB743BBE will be created
  + resource "github_actions_secret" "cdktn-provider-grafana_repo_secret-gh-token_BB743BBE" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-grafana"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-grafana_repo_secret-npm-token_6EACADC9 will be created
  + resource "github_actions_secret" "cdktn-provider-grafana_repo_secret-npm-token_6EACADC9" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-grafana"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-grafana_repo_secret-twine-password_EDC50453 will be created
  + resource "github_actions_secret" "cdktn-provider-grafana_repo_secret-twine-password_EDC50453" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-grafana"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-grafana_repo_secret-twine-username_4790E537 will be created
  + resource "github_actions_secret" "cdktn-provider-grafana_repo_secret-twine-username_4790E537" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-grafana"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.cdktn-provider-grafana_repository-setup_main-protection_0E132D74 will be created
  + resource "github_branch_protection" "cdktn-provider-grafana_repository-setup_main-protection_0E132D74" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "cdktn-provider-grafana"
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "Validate PR title",
              + "build",
              + "package-go",
              + "package-js",
              + "package-python",
            ]
          + strict   = false
        }
    }

  # github_issue_label.cdktn-provider-grafana-go_repository-setup_auto-approve-label_331D8E39 will be created
  + resource "github_issue_label" "cdktn-provider-grafana-go_repository-setup_auto-approve-label_331D8E39" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktn-provider-grafana-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-grafana-go_repository-setup_automerge-label_5BE66883 will be created
  + resource "github_issue_label" "cdktn-provider-grafana-go_repository-setup_automerge-label_5BE66883" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktn-provider-grafana-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-grafana-go_repository-setup_no-auto-close-label_ABC2F102 will be created
  + resource "github_issue_label" "cdktn-provider-grafana-go_repository-setup_no-auto-close-label_ABC2F102" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktn-provider-grafana-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-grafana_repository-setup_auto-approve-label_399E8E0D will be created
  + resource "github_issue_label" "cdktn-provider-grafana_repository-setup_auto-approve-label_399E8E0D" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktn-provider-grafana"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-grafana_repository-setup_automerge-label_E8BE19E5 will be created
  + resource "github_issue_label" "cdktn-provider-grafana_repository-setup_automerge-label_E8BE19E5" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktn-provider-grafana"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-grafana_repository-setup_no-auto-close-label_046099DB will be created
  + resource "github_issue_label" "cdktn-provider-grafana_repository-setup_no-auto-close-label_046099DB" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktn-provider-grafana"
      + url        = (known after apply)
    }

  # github_repository.cdktn-provider-grafana-go_repo_C6B04906 will be created
  + resource "github_repository" "cdktn-provider-grafana-go_repo_C6B04906" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "CDK Terrain Go provider bindings for grafana."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + homepage_url                = "https://cdktn.io"
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "cdktn-provider-grafana-go"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "PR_BODY"
      + squash_merge_commit_title   = "PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "cdk",
          + "cdk-terrain",
          + "cdktf",
          + "cdktn",
          + "grafana",
          + "opentofu",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = false
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository.cdktn-provider-grafana_repo_CFDFC0B3 will be created
  + resource "github_repository" "cdktn-provider-grafana_repo_CFDFC0B3" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Prebuilt CDK Terrain (cdktn) provider for grafana."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + homepage_url                = "https://cdktn.io"
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "cdktn-provider-grafana"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "PR_BODY"
      + squash_merge_commit_title   = "PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "cdk",
          + "cdk-terrain",
          + "cdktf",
          + "cdktn",
          + "grafana",
          + "opentofu",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository_dependabot_security_updates.cdktn-provider-grafana_dependabot-security_7178A046 will be created
  + resource "github_repository_dependabot_security_updates" "cdktn-provider-grafana_dependabot-security_7178A046" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "cdktn-provider-grafana"
    }

  # github_repository_webhook.cdktn-provider-grafana-go_repository-setup_slack-webhook_D221CB25 will be created
  + resource "github_repository_webhook" "cdktn-provider-grafana-go_repository-setup_slack-webhook_D221CB25" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktn-provider-grafana-go"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.cdktn-provider-grafana_repository-setup_slack-webhook_CBE74157 will be created
  + resource "github_repository_webhook" "cdktn-provider-grafana_repository-setup_slack-webhook_CBE74157" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktn-provider-grafana"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_team_repository.cdktn-provider-grafana-go_repository-setup_managing-team_9818985A will be created
  + resource "github_team_repository" "cdktn-provider-grafana-go_repository-setup_managing-team_9818985A" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktn-provider-grafana-go"
      + team_id    = "15746607"
    }

  # github_team_repository.cdktn-provider-grafana_repository-setup_managing-team_A9B867CF will be created
  + resource "github_team_repository" "cdktn-provider-grafana_repository-setup_managing-team_A9B867CF" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktn-provider-grafana"
      + team_id    = "15746607"
    }

Plan: 25 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ providerRepos = [
      + "github_repository.cdktn-provider-grafana_repo_CFDFC0B3.ssh_clone_url",
      + "github_repository.cdktn-provider-mongodbatlas_repo_310DCFD4.ssh_clone_url",
    ]

```

</details>

*Pusher: @so0k, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*